driver-tests/httpsoapbc/HttpSoapBCTests/HttpSoapBCJbi/test/MultiOp_UserTestCase_deleteInstance/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service">
  <soapenv:Body>
    <ser:deleteInstance>
      <ser:instanceId>?10?</ser:instanceId>
    </ser:deleteInstance>
  </soapenv:Body>
</soapenv:Envelope>